# 算术运算符：
# 加 +
# 减 -
# 乘 *
# 除 /
# 整除 //
# 取余数 %
# 指数 **

# print(eval("1+1"))
# print(eval("1-1"))
# print(eval("2*3"))
# print(eval("5/2"))
# print(eval("5//2"))
# print(eval("5%2"))
# print(eval("2**3"))

# 优先级：** > */%// > +-
# 不同类型的数字进行混合运算时，整数会转换为小数进行运算
# print(10 + 5.5 * 2)

# 赋值运算符：=
# a = 1

# 复合赋值运算符：
# +=      c += a  ----->   c = c + a
# -=      c -= a  ----->   c = c - a
# *=      c *= a  ----->   c = c * a
# /=      c /= a  ----->   c = c / a
# //=     c //= a  ----->   c = c // a
# %=      c %= a   ----->   c = c % a
# **=     c **= a  ----->   c = c ** a

# print(1 + 3 * 3 ** 2 + 4 // 2)
# a = 1
# b = 2
# c = 3
# a += c
# b **= a
# b %= c
# print(b)