# 集合：{1, 2, 3, "a", "b", "c"}

# 集合的特性：
# （1）无序性：里面的元素都是没有顺序的（没有索引，无法查找）
# s1 = {1, 2, 3, 4, 5}
# s2 = {"a", "b", "c", "d"}
# print(s1 | s2)
# （2）去重性：里面的元素都是没有重复的（天然去重）
# s3 = {1, 2, 2, 3, 3, 3, 4, 4, 4, 4}
# print(s3)
# （3）确定性：里面的元素都是不可变类型（无法修改）
# 不可变类型：数字、字符串、元组
# 可变类型：列表、字典、集合
# s4 = {1, 3.14, False, "hello", (1, 2, 3)}
# print(s4)


# 创建空类型：
# （1）空数字：
# n = 0
# n1 = int()
# n2 = float()
# print(n2)
# （2）空字符串：
# s = ""
# s1 = str()
# print(s1)
# （3）空列表：
# l = []
# l1 = list()
# print(l1)
# （4）空元组：
# t = ()
# t1 = tuple()
# print(t1)
# （5）空字典：
# d = {}
# d1 = dict()
# print(type(d))
# print(d1)
# （6）空集合：
# s = set()
# print(type(s))